JackABK/SmartEPW_Server_STM32F407/Smart_EPW_lib/EPW_behavior.c
/*============================================================================*/
/*============================================================================*
 ** function : init_External_Interrupt
 ** brief : connect the two encoder phase A to interrupt
 ** param : None
 ** retval : None
 **============================================================================*/
/*============================================================================*/
void init_External_Interrupt(void){
		GPIO_InitTypeDef GPIO_InitStruct;
		EXTI_InitTypeDef EXTI_InitStruct;
		NVIC_InitTypeDef NVIC_InitStructure;

		RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);


		/* Connect EXTI Line0 to PA0 pin */
		SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOA,EXTI_PinSource0);
		EXTI_InitStruct.EXTI_Line = EXTI_Line0;
		EXTI_InitStruct.EXTI_Mode = EXTI_Mode_Interrupt;
		EXTI_InitStruct.EXTI_Trigger = EXTI_Trigger_Rising;
		EXTI_InitStruct.EXTI_LineCmd = ENABLE;
		EXTI_Init(&EXTI_InitStruct);
		EXTI_ClearITPendingBit(EXTI_Line0);
		NVIC_InitStructure.NVIC_IRQChannel = EXTI0_IRQn;
		NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 3;
		NVIC_InitStructure.NVIC_IRQChannelSubPriority = 3;
		NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
		NVIC_Init(&NVIC_InitStructure);



		/* Connect EXTI Line1 to PA1 pin */
		SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOA,EXTI_PinSource1);
		EXTI_InitStruct.EXTI_Line = EXTI_Line1;
		EXTI_InitStruct.EXTI_Mode = EXTI_Mode_Interrupt;
		EXTI_InitStruct.EXTI_Trigger = EXTI_Trigger_Rising;
		EXTI_InitStruct.EXTI_LineCmd = ENABLE;
		EXTI_Init(&EXTI_InitStruct);
		EXTI_ClearITPendingBit(EXTI_Line1);
		NVIC_InitStructure.NVIC_IRQChannel = EXTI1_IRQn;
		NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 3;
		NVIC_InitStructure.NVIC_IRQChannelSubPriority = 3;
		NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
		NVIC_Init(&NVIC_InitStructure);
}


void init_EPW_control(){
        
		init_motor();
        init_motor_CWCCW();
        init_encoder();
		init_External_Interrupt();
        

		carTimers=xTimerCreate("Car_State_Polling",	 ( CAR_POLLING_PERIOD), pdTRUE, ( void * ) 1,  Car_State_Polling );
		xTimerStart( carTimers, 0 );


		PID_Timers=xTimerCreate("PID_Algorithm_Polling",( PID_POLLING_PERIOD), pdTRUE, ( void * ) 1,  PID_Algorithm_Polling);
		xTimerStart( PID_Timers, 0 );

        /*Initialization the right motor of pid paremeter.*/
        Kp_left=5.0f; Ki_left=0.5f; Kd_left=5.5f;
        Kp_right=5.0f; Ki_right=0.5f; Kd_right=5.5f;
        
        InitPID(&PID_Motor_L , Kp_left ,Ki_left,Kd_left);
        InitPID(&PID_Motor_R , Kp_right ,Ki_right,Kd_right);

        /*For motor driver, the default idle state pwm value need to set 2.5V, it should be stop.*/
        parse_EPW_motor_dir('s');    
      

#ifdef ACCESS_SDIO         
        /*sdio*/
        accsess_sdio_setup();
#endif
}



/*============================================================================*
 ** Prototype    : Car_State_Polling
 ** Description  : record the car's state of all behavior and keep to polling,
                   this is used for auto-avoidance polling mechanism
 ** Input        : None
 ** Output       : None
 ** Return Value : 
 *============================================================================*/
#define THRESHOLD_DISTANCE 50 /*unit : cm*/
/**
 *  the unit is  (CAR_POLLING_PERIOD ms) , so depend on the CAR_POLLING_PERIOD.
 *  for example the CAR_POLLING_PERIOD=20, CAR_MOVING_PERIOD=10,
 *  then the car moving will be keep 200(10*20) ms time.
 */
//#define CAR_MOVING_PERIOD 250 
#define CAR_MOVING_PERIOD 1500 
#define CAR_REST_PERIOD  5
void Car_State_Polling(){
		static int count=0;
        unsigned int distance[4];
        //distance[0]=Get_CH1Distance();
        //distance[1]=Get_CH2Distance();
        //distance[2]=Get_CH3Distance();
        //distance[3]=Get_CH4Distance();
        
		if(car_state==CAR_STATE_IDLE){
				count=0;
		}
		else if(car_state==CAR_STATE_REST){
                proc_cmd("stop" , MOTOR_IDLE_VOLTAGE , MOTOR_IDLE_VOLTAGE);
				count++;
				if(count>=CAR_REST_PERIOD){
						count=0;
						car_state=CAR_STATE_IDLE;
				}
		}
		else if(car_state==CAR_STATE_MOVE_FORWARD){
#if 0       
                if(distance[0]==0 || distance[1]==0){
                    car_state=CAR_STATE_IDLE;
                    return;
                }
                state|=((distance[0]>THRESHOLD_DISTANCE)?0x01:0x00);
                state|=((distance[1]>THRESHOLD_DISTANCE)?0x02:0x00);
                switch(state){
                    case 0x00:
                        //deadend
                        
                        break;
                    case 0x01:
                        //need to turn left
                        //proc_cmd("left" , pwm_value_left , pwm_value_right);

                        /*send warning message*/
                        //printf("Left %d %d" , distance[0] , distance[1]);
                        break;
                    case 0x02:
                        //need to turn right
                        //proc_cmd("right" , pwm_value_left , pwm_value_right);

                        /*send warning message*/
                        //printf("Right %d %d" , distance[0] , distance[1]);
                        break;
                    case 0x03:
                        //nothing ahead
                        break;
                }
#endif       
                count++;
				if(count>=CAR_MOVING_PERIOD){
						count=0;
						car_state=CAR_STATE_REST;
				}
		}	
		else if(car_state==CAR_STATE_MOVE_BACK){
				count++;
				if(count>=CAR_MOVING_PERIOD){
						count=0;
						car_state=CAR_STATE_REST;
				}
		}
        else if(car_state==CAR_STATE_MOVE_LEFT){
                count++;
				if(count>=CAR_MOVING_PERIOD){
						count=0;
						car_state=CAR_STATE_REST;
				}
		}   
        else if(car_state==CAR_STATE_MOVE_RIGHT){
                count++;
				if(count>=CAR_MOVING_PERIOD){
						count=0;
						car_state=CAR_STATE_REST;
    		    }
		}    
}

