JackABK/SmartEPW_Server_STM32F407/Smart_EPW_lib/EPW_behavior.c
/*============================================================================*/
/*============================================================================*
 ** function : parse_EPW_motor_dir
 ** brief : parse the EPW of motor direction from the uart siganl,
            note, the motor_pwm_value  max is 255, even if 256, it's duty cycle is equal to 255.
 ** param : DIR_cmd
 ** retval :  None
 **============================================================================*/
/*============================================================================*/
void parse_EPW_motor_dir(unsigned char DIR_cmd)
{
		if(DIR_cmd == 'f'){
                car_state = CAR_STATE_MOVE_FORWARD;
				encoder_left_counter=0;
				encoder_right_counter=0;
                encoder_left_counter_sum=0;
                encoder_right_counter_sum=0;
                //specified_distance_convert_to_setRPM(MOTOR_CW, global_specified_distance_value); 
				pwm_value_left_mcu = 150;
				pwm_value_right_mcu=pwm_value_left_mcu;
				proc_cmd("forward" , pwm_value_left_mcu , pwm_value_right_mcu);
                
		}
		else if(DIR_cmd == 's'){
				car_state = CAR_STATE_REST;
				encoder_left_counter=0;
				encoder_right_counter=0;
                encoder_left_counter_sum=0;
                encoder_right_counter_sum=0;
				/*even stop function is  always zero , but for security, I also set speedvalue to zero.*/
				pwm_value_left = MOTOR_IDLE_VOLTAGE;
				pwm_value_right = MOTOR_IDLE_VOLTAGE;
				proc_cmd("stop" , pwm_value_left , pwm_value_right);

		}
		else if(DIR_cmd == 'b'){
                car_state = CAR_STATE_MOVE_BACK;
				encoder_left_counter=0;
				encoder_right_counter=0;
                encoder_left_counter_sum=0;
                encoder_right_counter_sum=0;
                //specified_distance_convert_to_setRPM(MOTOR_CCW, global_specified_distance_value); 
				
                pwm_value_left_mcu=110;
                pwm_value_right_mcu=pwm_value_left_mcu;

				proc_cmd("backward" , pwm_value_left_mcu , pwm_value_right_mcu);
		}
        else if(DIR_cmd == 'l'){
             /*testing by PID calibration using.*/
            #if 0
                car_state = CAR_STATE_MOVE_LEFT;
				encoder_left_counter=0;
				encoder_right_counter=0;
                encoder_left_counter_sum=0;
                encoder_right_counter_sum=0;
				pwm_value_left = 100; 
				pwm_value_right= 150; 
				proc_cmd("left" , pwm_value_left , pwm_value_right);
            #endif
            flag_PID_L_R = 1;
		}
        else if(DIR_cmd == 'r'){
            /*testing by PID calibration using.*/
            #if 0
                car_state = CAR_STATE_MOVE_RIGHT;
				encoder_left_counter=0;
				encoder_right_counter=0;
                encoder_left_counter_sum=0;
                encoder_right_counter_sum=0;
				pwm_value_left = 150; 
				pwm_value_right=100;
				proc_cmd("right" , pwm_value_left , pwm_value_right);
            #endif
            flag_PID_L_R = 2;
		}
		else{
				/*do not anything*/
		}
}


/*============================================================================*/
/*============================================================================*
 ** function : specified_distance_convert_to_setRPM
 ** brief : 
 **         1 speed value convert to 8 pwm scale.
 ** param : motor_dir, specified_distance_value
 ** retval : Null
 **============================================================================*/
/*============================================================================*/
void specified_distance_convert_to_setRPM(int motor_dir, int specified_distance_value){
    if(car_state == CAR_STATE_MOVE_FORWARD) set_encoder_count = 5.0f; //fixed the speed of per second.
    else if(car_state == CAR_STATE_MOVE_BACK) set_encoder_count = 5.0f; //back should be slow more then forward
}
void PerformCommand(unsigned char group,unsigned char control_id, unsigned char value)
{
   static int actuator_pwm_value=0;
   if(group == OUT_EPW_CMD){ /*0*/
		switch ( control_id )
		{
		    case EPW_MOTOR_DIR:
		        parse_EPW_motor_dir(value);
		        break;
		    case EPW_MOTOR_PWM:
		        global_specified_distance_value = value; /*0~10 scale*/
		        break;
		    case EPW_ACTUATOR_A :
		        set_linearActuator_A_cmd(value , actuator_pwm_value); /*the actuator of pwm_value is fixed, value is dir flag.*/
		        break;
		    case EPW_ACTUATOR_B :   
		        set_linearActuator_B_cmd(value , actuator_pwm_value); /*the actuator of pwm_value is fixed. value is dir flag.*/
		        break;
		    case EPW_PID_ALG_KP :
                 if(flag_PID_L_R==1){/*L*/
                    Kp_left = (float)value / 10.0f;
                    PID_Motor_L.Kp = Kp_left; PID_Motor_L.Ki = Ki_left; PID_Motor_L.Kd=Kd_left;
                 }else if(flag_PID_L_R==2){/*R*/
                    Kp_right=(float)value / 10.0f;
                    PID_Motor_R.Kp = Kp_right; PID_Motor_R.Ki = Ki_right; PID_Motor_R.Kd=Kd_right;
                 }
                 #if 0
                 Kp_left = (float)value / 10.0f;
                 //Kp_right= (  (float)value - 1.0f )/ 10.0f;
                 Kp_right=Kp_left;
                 PID_Motor_L.Kp = Kp_left; PID_Motor_L.Ki = Ki_left; PID_Motor_L.Kd=Kd_left;
                 PID_Motor_R.Kp = Kp_right; PID_Motor_R.Ki = Ki_right; PID_Motor_R.Kd=Kd_right;
                 #endif
		        break;
		    case EPW_PID_ALG_KI :
                if(flag_PID_L_R==1){/*L*/
                    Ki_left = (float)value / 10.0f; 
                    PID_Motor_L.Kp = Kp_left; PID_Motor_L.Ki = Ki_left; PID_Motor_L.Kd=Kd_left;
                 }else if(flag_PID_L_R==2){/*R*/
                    Ki_right=(float)value / 10.0f;
                    PID_Motor_R.Kp = Kp_right; PID_Motor_R.Ki = Ki_right; PID_Motor_R.Kd=Kd_right;
                 }
                 #if 0
                 Ki_left = (float)value / 10.0f;  
                 //Ki_right= (  (float)value + 1.0f )/ 10.0f;
                 Ki_right=Ki_left;
                 PID_Motor_L.Kp = Kp_left; PID_Motor_L.Ki = Ki_left; PID_Motor_L.Kd=Kd_left;
                 PID_Motor_R.Kp = Kp_right; PID_Motor_R.Ki = Ki_right; PID_Motor_R.Kd=Kd_right;
                 #endif
		        break;
            case EPW_PID_ALG_KD :
                if(flag_PID_L_R==1){/*L*/
                    Kd_left = (float)value / 10.0f; 
                    PID_Motor_L.Kp = Kp_left; PID_Motor_L.Ki = Ki_left; PID_Motor_L.Kd=Kd_left;
                 }else if(flag_PID_L_R==2){/*R*/
                    Kd_right=(float)value / 10.0f;
                    PID_Motor_R.Kp = Kp_right; PID_Motor_R.Ki = Ki_right; PID_Motor_R.Kd=Kd_right;
                 }
                 #if 0
                 Kd_left = (float)value / 10.0f;  
                 Kd_right= Kd_left;
		         PID_Motor_L.Kp = Kp_left; PID_Motor_L.Ki = Ki_left; PID_Motor_L.Kd=Kd_left;
                 PID_Motor_R.Kp = Kp_right; PID_Motor_R.Ki = Ki_right; PID_Motor_R.Kd=Kd_right;
                 #endif
		        break;
            case EPW_SET_ENCODER_COUNT:
		        set_encoder_count= (float)value; /*0~15 scale*/
		        break;
		    default:
		        ;
		}
   }
}



