JackABK/SmartEPW_Server_STM32F407/Smart_EPW_lib/EPW_behavior.c
/*============================================================================*/
/*============================================================================*
 ** function : PID_Algorithm_Polling
 ** brief : loop read the encoder signal  and caclulator the RPM , the cycle time is 20msec
 ** param : None
 ** retval : None
 **============================================================================*/
/*============================================================================*/
#define OUTPUT_INFO_PERIOD 25 /*unit : PID_POLLING_PERIOD ms*/
void PID_Algorithm_Polling(void)
{

		detachInterrupt(EXTI_Line0); /*close external interrupt 0*/ 
		detachInterrupt(EXTI_Line1); /*close external interrupt 1*/ 
        float temp ;
        /*get the two motor parameter such as RPM, Rotations..*/
        getMotorData();

		/*restart motor calibration and re-count encoder count*/
		if(car_state == CAR_STATE_MOVE_FORWARD){
                if(encoder_left_counter_sum>= math_round((float)global_specified_distance_value*0.86f*500.0f) &&  encoder_right_counter_sum>=math_round((float)global_specified_distance_value*0.86f*500.0f)){
                    proc_cmd("stop" , MOTOR_IDLE_VOLTAGE , MOTOR_IDLE_VOLTAGE);
                    car_state = CAR_STATE_IDLE;
                    arrived_to_specify_goal=1;
                    encoder_left_counter_sum=0;
                    encoder_right_counter_sum=0; 
#ifdef ACCESS_SDIO         
                    access_data_to_sdio();
#endif
                }
                //else if(encoder_left_counter==0&&encoder_right_counter==0){
                //        ;//proc_cmd("stop" , MOTOR_IDLE_VOLTAGE , MOTOR_IDLE_VOLTAGE);//detected no feedback
                //}
                else{/*detected encoder data, start to PID alg.*/
#ifdef ACCESS_SDIO         
                        access_data_to_sdio();
#endif
                        /*calculate Position PID of two motor*/
                        pwm_value_left_pid = math_round(PID_Pos_Calc(&PID_Motor_L , set_encoder_count , encoder_left_counter));
                        pwm_value_right_pid = math_round(PID_Pos_Calc(&PID_Motor_R , set_encoder_count , encoder_right_counter));
                        /** 
                         * the motor driver of pwm value accept CW is 127~200 for security
                         * the motor driver of pwm value accept CCW is 50~127 for security
                         **/

                        pwm_value_left_mcu = pwm_value_left_pid;
                        pwm_value_right_mcu = pwm_value_right_pid;

                        if(pwm_value_left_mcu <=127){
                            pwm_value_left_mcu = 127;
                        }else if (pwm_value_left_mcu >=190){
                            pwm_value_left_mcu = 190;
                        }
                        if(pwm_value_right_mcu <=127){ 
                            pwm_value_right_mcu = 127;
                        }else if(pwm_value_right_mcu >=190){
                            pwm_value_right_mcu = 190;
                            
                        }
                        proc_cmd("forward" , pwm_value_left_mcu , pwm_value_right_mcu);
                }
		}
		else if(car_state == CAR_STATE_MOVE_BACK) {
                if(encoder_left_counter_sum>= math_round((float)global_specified_distance_value*0.86f*500.0f) && encoder_right_counter_sum>=math_round((float)global_specified_distance_value*0.86f*500.0f)){
                    proc_cmd("stop" , MOTOR_IDLE_VOLTAGE , MOTOR_IDLE_VOLTAGE);
                    car_state = CAR_STATE_IDLE;
                    arrived_to_specify_goal=1;
                    encoder_left_counter_sum=0;
                    encoder_right_counter_sum=0; 
#ifdef ACCESS_SDIO         
                    access_data_to_sdio();
#endif
                }
                //else if(encoder_left_counter==0&&encoder_right_counter==0){
                //    ;//proc_cmd("stop" , MOTOR_IDLE_VOLTAGE , MOTOR_IDLE_VOLTAGE);//detected no feedback
                //}
                else{/*detected encoder data, start to PID alg.*/
#ifdef ACCESS_SDIO         
                    access_data_to_sdio();
#endif
                    /*calculate Position PID of two motor*/    
                    pwm_value_left_pid = math_round(PID_Pos_Calc(&PID_Motor_L , set_encoder_count , encoder_left_counter));
                    pwm_value_right_pid = math_round(PID_Pos_Calc(&PID_Motor_R , set_encoder_count , encoder_right_counter));
                    
                    pwm_value_left_err =pwm_value_left_pid - pwm_value_left;
                    pwm_value_right_err =pwm_value_right_pid - pwm_value_right;
                 
                    /*record the last pwm value.*/
                    pwm_value_left = pwm_value_left_pid; 
                    pwm_value_right = pwm_value_right_pid;
  
                    pwm_value_left_mcu = pwm_value_left_mcu-pwm_value_left_err;
                    pwm_value_right_mcu = pwm_value_right_mcu-pwm_value_right_err;
                    /** 
                     * the motor driver of pwm value accept CW is 127~200 for security
                     * the motor driver of pwm value accept CCW is 50~127 for security
                     **/
                    if(pwm_value_left_mcu <=90){
                        pwm_value_left_mcu = 90;
                    }else if (pwm_value_left_mcu >=127){
                        pwm_value_left_mcu = 127;
                    }
                    if(pwm_value_right_mcu <=90){
                        pwm_value_right_mcu = 90;
                    }else if(pwm_value_right_mcu >=127){
                        pwm_value_right_mcu = 127;
                    }
                    proc_cmd("backward" , pwm_value_left_mcu , pwm_value_right_mcu);
                }
		}

        encoder_left_counter = 0;   
        encoder_right_counter = 0; 

		/*restart enable the external interrupt*/
		attachInterrupt(EXTI_Line0); 
		attachInterrupt(EXTI_Line1);
}

void getMotorData(void)
{
    /*for SmartEPW is used by 500 pulse/rev,  =>  encoder_left_counter * (2.0f/3.0f)* 60.0f /500.0f / 0.02f*/
    rpm_left_motor=(float)encoder_left_counter * 4.0f;
    rpm_right_motor=(float)encoder_right_counter * 4.0f;    

    //get the speed of the two motors in deg/sec
    /***do someting***/ 
}

