JackABK/SmartEPW_Server_STM32F407/Smart_EPW_lib/EPW_behavior.c
void accsess_sdio_setup()
{
    // Initialise media
    media_init();

    // Initialise File IO Library
    fl_init();

    // Attach media access functions to library
    if (fl_attach_media(media_read, media_write) != FAT_INIT_OK)
    {
        printf("ERROR: Media attach failed\n");
        return; 
    }
    // List root directory
    fl_listdirectory("/");

    // Create File
    file = fl_fopen("/PID_2.txt", "a+");
    if (file)
    {
       printf("success to open the file\n");
    }
    else
       printf("ERROR: Create file failed\n");
    
           
    fl_fputs("Hello",file);

   
    // Close file
    fl_fclose(file);
    
    // Delete File
    //if (fl_remove("/file.bin") < 0)
    //printf("ERROR: Delete file failed\n");

    // List root directory
    //fl_listdirectory("/");

    //fl_shutdown();
}
void access_data_to_sdio(void){
    static char dir_str[4] = {0,0,0,0};
    static char Kp_str[4];
    static char Ki_str[4];
    static char Kd_str[4];
    static char Kp_right_str[4];
    static char Ki_right_str[4];
    static char Kd_right_str[4];
    static char pwm_left_value_str[4];
    static char pwm_right_value_str[4];
    static char encoder_left_cnt_str[4];
    static char encoder_right_cnt_str[4];
    static char rpm_left_str[4];
    static char rpm_right_str[4];
    static char set_rpm_str[4];
    static char set_encoder_count_str[4];
    
    if(car_state==CAR_STATE_MOVE_FORWARD) dir_str[0] = 'f';
    else if(car_state==CAR_STATE_MOVE_BACK) dir_str[0] = 'b';
    
    int2str((int)(Kp_left*10.0f), Kp_str);
    int2str((int)(Ki_left*10.0f), Ki_str);
    int2str((int)(Kd_left*10.0f), Kd_str);
    int2str((int)(Kp_right*10.0f), Kp_right_str);
    int2str((int)(Ki_right*10.0f), Ki_right_str);
    int2str((int)(Kd_right*10.0f), Kd_right_str);
    
    
    int2str((int)(pwm_value_left_mcu), pwm_left_value_str);
    int2str((int)(pwm_value_right_mcu), pwm_right_value_str);
    
   
    int2str((int)(encoder_left_counter), encoder_left_cnt_str);
    int2str((int)(encoder_right_counter), encoder_right_cnt_str);
    int2str((int)(rpm_left_motor), rpm_left_str);
    int2str((int)(rpm_right_motor), rpm_right_str);
    int2str((int)(set_encoder_count), set_encoder_count_str);
    
     // Create File
    file = fl_fopen("/PID_2.txt", "a+");
    if (file)
    {
        printf("success to open the file\n");
    }
    else
        printf("ERROR: Create file failed\n");

    fl_fseek(file,0,SEEK_END);
    //fl_fread(index,1,sizeof(unsigned char),file);

    fl_fputs(dir_str,file);
    fl_fputs("\t",file);
    fl_fputs(Kp_str,file);
    fl_fputs("\t",file);
    fl_fputs(Ki_str,file);
    fl_fputs("\t",file);
    fl_fputs(Kd_str,file);
    fl_fputs("\t",file);
    fl_fputs(Kp_right_str,file);
    fl_fputs("\t",file);
    fl_fputs(Ki_right_str,file);
    fl_fputs("\t",file);
    fl_fputs(Kd_right_str,file);
    fl_fputs("\t",file);
    fl_fputs(pwm_left_value_str,file);
    fl_fputs("\t",file);
    fl_fputs(pwm_right_value_str,file);
    fl_fputs("\t",file);
    fl_fputs(encoder_left_cnt_str,file);
    fl_fputs("\t",file);
    fl_fputs(encoder_right_cnt_str,file);
    fl_fputs("\t",file);
    fl_fputs(rpm_left_str,file);
    fl_fputs("\t",file);
    fl_fputs(rpm_right_str,file);
    fl_fputs("\t",file);
    fl_fputs(set_encoder_count_str,file);
    //fl_fputs(set_rpm_str,file);
    fl_fputs("\t",file);
    fl_fputs("\n",file);

    /*split the period of recording.*/
    if(arrived_to_specify_goal){
        fl_fputs("\n",file);
        arrived_to_specify_goal=0;
    }
    
    // Close file
    fl_fclose(file);
}
void EXTI0_IRQHandler(){

		if(EXTI_GetITStatus(EXTI_Line0) != RESET)
		{
                encoder_left_counter_sum++; 
				encoder_left_counter++ ;
				EXTI_ClearITPendingBit(EXTI_Line0);
		}
}

void EXTI1_IRQHandler(){
		if(EXTI_GetITStatus(EXTI_Line1) != RESET)
		{
            
                encoder_right_counter_sum++; 
				encoder_right_counter++ ;
				EXTI_ClearITPendingBit(EXTI_Line1);
		}
}


void detachInterrupt(uint32_t EXTI_LineX){
		EXTI_InitTypeDef EXTI_InitStruct;
		EXTI_InitStruct.EXTI_Line = EXTI_LineX;
		EXTI_InitStruct.EXTI_LineCmd = DISABLE;
}

void attachInterrupt(uint32_t EXTI_LineX){
		EXTI_InitTypeDef EXTI_InitStruct;
		EXTI_InitStruct.EXTI_Line = EXTI_LineX;
		EXTI_InitStruct.EXTI_LineCmd = ENABLE;
}
